package com.example.wuxio.jsonparserlib.json;

/**
 * @author wuxio 2018-05-15:11:16
 */
public class WeatherJson {

    public static final String JSON = "{\n" +
            "    \"status\": \"0\",\n" +
            "    \"msg\": \"ok\",\n" +
            "    \"result\": {\n" +
            "        \"city\": \"安顺\",\n" +
            "        \"cityid\": \"111\",\n" +
            "        \"citycode\": \"101260301\",\n" +
            "        \"date\": \"2018-05-15\",\n" +
            "        \"week\": \"星期二\",\n" +
            "        \"weather\": \"晴\",\n" +
            "        \"temp\": \"20\",\n" +
            "        \"temphigh\": \"27\",\n" +
            "        \"templow\": \"18\",\n" +
            "        \"img\": \"0\",\n" +
            "        \"humidity\": \"71\",\n" +
            "        \"pressure\": \"848\",\n" +
            "        \"windspeed\": \"9.1\",\n" +
            "        \"winddirect\": \"南风\",\n" +
            "        \"windpower\": \"3级\",\n" +
            "        \"updatetime\": \"2018-05-15 08:35:00\",\n" +
            "        \"index\": [\n" +
            "            {\n" +
            "                \"iname\": \"空调指数\",\n" +
            "                \"ivalue\": \"较少开启\",\n" +
            "                \"detail\": \"您将感到很舒适，一般不需要开启空调。\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"iname\": \"运动指数\",\n" +
            "                \"ivalue\": \"较适宜\",\n" +
            "                \"detail\": \"天气较好，户外运动请注意防晒。推荐您进行室内运动。\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"iname\": \"紫外线指数\",\n" +
            "                \"ivalue\": \"强\",\n" +
            "                \"detail\": \"紫外线辐射强，建议涂擦SPF20左右、PA++的防晒护肤品。避免在10点至14点暴露于日光下。\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"iname\": \"感冒指数\",\n" +
            "                \"ivalue\": \"少发\",\n" +
            "                \"detail\": \"各项气象条件适宜，无明显降温过程，发生感冒机率较低。\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"iname\": \"洗车指数\",\n" +
            "                \"ivalue\": \"较适宜\",\n" +
            "                \"detail\": \"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"iname\": \"空气污染扩散指数\",\n" +
            "                \"ivalue\": \"中\",\n" +
            "                \"detail\": \"气象条件对空气污染物稀释、扩散和清除无明显影响，易感人群应适当减少室外活动时间。\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"iname\": \"穿衣指数\",\n" +
            "                \"ivalue\": \"舒适\",\n" +
            "                \"detail\": \"建议着长袖T恤、衬衫加单裤等服装。年老体弱者宜着针织长袖衬衫、马甲和长裤。\"\n" +
            "            }\n" +
            "        ],\n" +
            "        \"aqi\": {\n" +
            "            \"so2\": \"2\",\n" +
            "            \"so224\": \"3\",\n" +
            "            \"no2\": \"3\",\n" +
            "            \"no224\": \"7\",\n" +
            "            \"co\": \"0.530\",\n" +
            "            \"co24\": \"0.550\",\n" +
            "            \"o3\": \"90\",\n" +
            "            \"o38\": \"94\",\n" +
            "            \"o324\": \"97\",\n" +
            "            \"pm10\": \"37\",\n" +
            "            \"pm1024\": \"34\",\n" +
            "            \"pm2_5\": \"20\",\n" +
            "            \"pm2_524\": \"20\",\n" +
            "            \"iso2\": \"1\",\n" +
            "            \"ino2\": \"2\",\n" +
            "            \"ico\": \"6\",\n" +
            "            \"io3\": \"29\",\n" +
            "            \"io38\": \"47\",\n" +
            "            \"ipm10\": \"37\",\n" +
            "            \"ipm2_5\": \"29\",\n" +
            "            \"aqi\": \"47\",\n" +
            "            \"primarypollutant\": \"O3\",\n" +
            "            \"quality\": \"优\",\n" +
            "            \"timepoint\": \"2018-05-15 05:00:00\",\n" +
            "            \"aqiinfo\": {\n" +
            "                \"level\": \"一级\",\n" +
            "                \"color\": \"#00e400\",\n" +
            "                \"affect\": \"空气质量令人满意，基本无空气污染\",\n" +
            "                \"measure\": \"各类人群可正常活动\"\n" +
            "            }\n" +
            "        },\n" +
            "        \"daily\": [\n" +
            "            {\n" +
            "                \"date\": \"2018-05-15\",\n" +
            "                \"week\": \"星期二\",\n" +
            "                \"sunrise\": \"06:11\",\n" +
            "                \"sunset\": \"19:35\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"多云\",\n" +
            "                    \"templow\": \"18\",\n" +
            "                    \"img\": \"1\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"晴\",\n" +
            "                    \"temphigh\": \"27\",\n" +
            "                    \"img\": \"0\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            },\n" +
            "            {\n" +
            "                \"date\": \"2018-05-16\",\n" +
            "                \"week\": \"星期三\",\n" +
            "                \"sunrise\": \"06:10\",\n" +
            "                \"sunset\": \"19:36\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"多云\",\n" +
            "                    \"templow\": \"19\",\n" +
            "                    \"img\": \"1\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"晴\",\n" +
            "                    \"temphigh\": \"28\",\n" +
            "                    \"img\": \"0\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            },\n" +
            "            {\n" +
            "                \"date\": \"2018-05-17\",\n" +
            "                \"week\": \"星期四\",\n" +
            "                \"sunrise\": \"06:10\",\n" +
            "                \"sunset\": \"19:36\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"多云\",\n" +
            "                    \"templow\": \"20\",\n" +
            "                    \"img\": \"1\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"晴\",\n" +
            "                    \"temphigh\": \"28\",\n" +
            "                    \"img\": \"0\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            },\n" +
            "            {\n" +
            "                \"date\": \"2018-05-18\",\n" +
            "                \"week\": \"星期五\",\n" +
            "                \"sunrise\": \"06:09\",\n" +
            "                \"sunset\": \"19:37\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"雷阵雨\",\n" +
            "                    \"templow\": \"19\",\n" +
            "                    \"img\": \"4\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"多云\",\n" +
            "                    \"temphigh\": \"28\",\n" +
            "                    \"img\": \"1\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            },\n" +
            "            {\n" +
            "                \"date\": \"2018-05-19\",\n" +
            "                \"week\": \"星期六\",\n" +
            "                \"sunrise\": \"06:09\",\n" +
            "                \"sunset\": \"19:37\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"雷阵雨\",\n" +
            "                    \"templow\": \"19\",\n" +
            "                    \"img\": \"4\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"多云\",\n" +
            "                    \"temphigh\": \"26\",\n" +
            "                    \"img\": \"1\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            },\n" +
            "            {\n" +
            "                \"date\": \"2018-05-20\",\n" +
            "                \"week\": \"星期日\",\n" +
            "                \"sunrise\": \"06:08\",\n" +
            "                \"sunset\": \"19:38\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"雷阵雨\",\n" +
            "                    \"templow\": \"20\",\n" +
            "                    \"img\": \"4\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"阵雨\",\n" +
            "                    \"temphigh\": \"26\",\n" +
            "                    \"img\": \"3\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            },\n" +
            "            {\n" +
            "                \"date\": \"2018-05-21\",\n" +
            "                \"week\": \"星期一\",\n" +
            "                \"sunrise\": \"06:08\",\n" +
            "                \"sunset\": \"19:38\",\n" +
            "                \"night\": {\n" +
            "                    \"weather\": \"大雨\",\n" +
            "                    \"templow\": \"19\",\n" +
            "                    \"img\": \"9\",\n" +
            "                    \"winddirect\": \"持续无风向\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                },\n" +
            "                \"day\": {\n" +
            "                    \"weather\": \"阵雨\",\n" +
            "                    \"temphigh\": \"27\",\n" +
            "                    \"img\": \"3\",\n" +
            "                    \"winddirect\": \"南风\",\n" +
            "                    \"windpower\": \"微风\"\n" +
            "                }\n" +
            "            }\n" +
            "        ],\n" +
            "        \"hourly\": [\n" +
            "            {\n" +
            "                \"time\": \"8:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"20\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"9:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"22\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"10:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"23\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"11:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"24\",\n" +
            "                \"img\": \"1\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"12:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"25\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"13:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"26\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"14:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"27\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"15:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"27\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"16:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"27\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"17:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"26\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"18:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"25\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"19:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"24\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"20:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"22\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"21:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"21\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"22:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"21\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"23:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"21\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"0:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"20\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"1:00\",\n" +
            "                \"weather\": \"晴\",\n" +
            "                \"temp\": \"20\",\n" +
            "                \"img\": \"0\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"2:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"20\",\n" +
            "                \"img\": \"1\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"3:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"19\",\n" +
            "                \"img\": \"1\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"4:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"19\",\n" +
            "                \"img\": \"1\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"5:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"19\",\n" +
            "                \"img\": \"1\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"6:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"18\",\n" +
            "                \"img\": \"1\"\n" +
            "            },\n" +
            "            {\n" +
            "                \"time\": \"7:00\",\n" +
            "                \"weather\": \"多云\",\n" +
            "                \"temp\": \"18\",\n" +
            "                \"img\": \"1\"\n" +
            "            }\n" +
            "        ]\n" +
            "    }\n" +
            "}";

}
